#text dictionary list excel cvs github html json

#pip instal pandas

In [1769]:
import  pandas as pd

#read data

In [1770]:
pd.read_csv("D:\index\python4-5pm\car_data1.csv")

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0

In [1771]:
df = pd.read_csv(r"D:\index\python4-5pm\car_data1.csv")

In [1772]:
df

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0

In [1773]:
type(df)

pandas.core.frame.DataFrame

In [1774]:
pd.read_excel("D:\index\python4-5pm\Titanic.xlsx")

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [1775]:
pd.read_excel("D:\index\python4-5pm\Titanic.xlsx",sheet_name='abc')

     1                            Braund, Mr. Owen Harris
0    2  Cumings, Mrs. John Bradley (Florence Briggs Th...
1    3                             Heikkinen, Miss. Laina
2    4       Futrelle, Mrs. Jacques Heath (Lily May Peel)
3    5                           Allen, Mr. William Henry
4    6                                   Moran, Mr. James
5    7                            McCarthy, Mr. Timothy J
6    8                     Palsson, Master. Gosta Leonard
7    9  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
8   10                Nasser, Mrs. Nicholas (Adele Achem)
9   11                    Sandstrom, Miss. Marguerite Rut
10  12                           Bonnell, Miss. Elizabeth

In [1776]:
df = pd.read_excel("D:\index\python4-5pm\Titanic.xlsx",header=None,)

In [1777]:
pd.read_excel("D:\index\python4-5pm\Titanic.xlsx",sheet_name='abc',header=None,names=['index','passenger'])

    index                                          passenger
0       1                            Braund, Mr. Owen Harris
1       2  Cumings, Mrs. John Bradley (Florence Briggs Th...
2       3                             Heikkinen, Miss. Laina
3       4       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4       5                           Allen, Mr. William Henry
5       6                                   Moran, Mr. James
6       7                            McCarthy, Mr. Timothy J
7       8                     Palsson, Master. Gosta Leonard
8       9  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9      10                Nasser, Mrs. Nicholas (Adele Achem)
10     11                    Sandstrom, Miss. Marguerite Rut
11     12                           Bonnell, Miss. Elizabeth

In [1778]:
pd.read_excel("D:\index\python4-5pm\Titanic.xlsx",sheet_name='Sheet1',header=None,names=['A', 'B', 'C'])

,,,,,,,,,A,B,C
PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1,"Braund, Mr. Owen Harris",3,male,22,1,0,A/5 21171,7.25,NaN,S,0
2,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",1,female,38,1,0,PC 17599,71.2833,C85,C,1
3,"Heikkinen, Miss. Laina",3,female,26,0,0,STON/O2. 3101282,7.925,NaN,S,1
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35,1,0,113803,53.1,C123,S,1
...,...,...,...,...,...,...,...,...,...,...,...
887,"Montvila, Rev. Juozas",2,male,27,0,0,211536,13,NaN,S,0
888,"Graham, Miss. Margaret Edith",1,female,19,0,0,112053,30,B42,S,1
889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.45,NaN,S,0
890,"Behr, Mr. Karl Howell",1,male,26,0,0,111369,30,C148,C,1
891,"Dooley, Mr. Patrick",3,male,32,0,0,370376,7.75,NaN,Q,0

In [1779]:
df

,0,1,2,3,4,5,6,7,8,9,10,11
0,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1,1,"Braund, Mr. Owen Harris",3,male,22,1,0,A/5 21171,7.25,NaN,S,0
2,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38,1,0,PC 17599,71.2833,C85,C,1
3,3,"Heikkinen, Miss. Laina",3,female,26,0,0,STON/O2. 3101282,7.925,NaN,S,1
4,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35,1,0,113803,53.1,C123,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...
887,887,"Montvila, Rev. Juozas",2,male,27,0,0,211536,13,NaN,S,0
888,888,"Graham, Miss. Margaret Edith",1,female,19,0,0,112053,30,B42,S,1
889,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.45,NaN,S,0
890,890,"Behr, Mr. Karl Howell",1,male,26,0,0,111369,30,C148,C,1
891,891,"Dooley, Mr. Patrick",3,male,32,0,0,370376,7.75,NaN,Q,0

In [1780]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1,1,"Braund, Mr. Owen Harris",3,male,22,1,0,A/5 21171,7.25,NaN,S,0
2,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38,1,0,PC 17599,71.2833,C85,C,1
3,3,"Heikkinen, Miss. Laina",3,female,26,0,0,STON/O2. 3101282,7.925,NaN,S,1
4,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35,1,0,113803,53.1,C123,S,1

In [1781]:
df.tail()

,0,1,2,3,4,5,6,7,8,9,10,11
887,887,"Montvila, Rev. Juozas",2,male,27,0,0,211536,13,NaN,S,0
888,888,"Graham, Miss. Margaret Edith",1,female,19,0,0,112053,30,B42,S,1
889,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.45,NaN,S,0
890,890,"Behr, Mr. Karl Howell",1,male,26,0,0,111369,30,C148,C,1
891,891,"Dooley, Mr. Patrick",3,male,32,0,0,370376,7.75,NaN,Q,0

In [1782]:
df.head(10)

,0,1,2,3,4,5,6,7,8,9,10,11
0,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1,1,"Braund, Mr. Owen Harris",3,male,22,1,0,A/5 21171,7.25,NaN,S,0
2,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38,1,0,PC 17599,71.2833,C85,C,1
3,3,"Heikkinen, Miss. Laina",3,female,26,0,0,STON/O2. 3101282,7.925,NaN,S,1
4,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35,1,0,113803,53.1,C123,S,1
5,5,"Allen, Mr. William Henry",3,male,35,0,0,373450,8.05,NaN,S,0
6,6,"Moran, Mr. James",3,male,NaN,0,0,330877,8.4583,NaN,Q,0
7,7,"McCarthy, Mr. Timothy J",1,male,54,0,0,17463,51.8625,E46,S,0
8,8,"Palsson, Master. Gosta Leonard",3,male,2,3,1,349909,21.075,NaN,S,0
9,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",3,female,27,0,2,347742,11.1333,NaN,S,1

In [1783]:
df.tail(10)

,0,1,2,3,4,5,6,7,8,9,10,11
882,882,"Markun, Mr. Johann",3,male,33,0,0,349257,7.8958,NaN,S,0
883,883,"Dahlberg, Miss. Gerda Ulrika",3,female,22,0,0,7552,10.5167,NaN,S,0
884,884,"Banfield, Mr. Frederick James",2,male,28,0,0,C.A./SOTON 34068,10.5,NaN,S,0
885,885,"Sutehall, Mr. Henry Jr",3,male,25,0,0,SOTON/OQ 392076,7.05,NaN,S,0
886,886,"Rice, Mrs. William (Margaret Norton)",3,female,39,0,5,382652,29.125,NaN,Q,0
887,887,"Montvila, Rev. Juozas",2,male,27,0,0,211536,13,NaN,S,0
888,888,"Graham, Miss. Margaret Edith",1,female,19,0,0,112053,30,B42,S,1
889,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.45,NaN,S,0
890,890,"Behr, Mr. Karl Howell",1,male,26,0,0,111369,30,C148,C,1
891,891,"Dooley, Mr. Patrick",3,male,32,0,0,370376,7.75,NaN,Q,0

In [1784]:
df.shape

(892, 12)

In [1785]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1,1,"Braund, Mr. Owen Harris",3,male,22,1,0,A/5 21171,7.25,NaN,S,0
2,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38,1,0,PC 17599,71.2833,C85,C,1
3,3,"Heikkinen, Miss. Laina",3,female,26,0,0,STON/O2. 3101282,7.925,NaN,S,1
4,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35,1,0,113803,53.1,C123,S,1

In [1786]:
df.shape

(892, 12)

In [1787]:
d = {"key":"value","age":21}

In [1788]:
d['age']

21

In [1789]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1,1,"Braund, Mr. Owen Harris",3,male,22,1,0,A/5 21171,7.25,NaN,S,0
2,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38,1,0,PC 17599,71.2833,C85,C,1
3,3,"Heikkinen, Miss. Laina",3,female,26,0,0,STON/O2. 3101282,7.925,NaN,S,1
4,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35,1,0,113803,53.1,C123,S,1

In [1790]:
pd.read_excel("D:\index\python4-5pm\Titanic.xlsx")

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [1791]:
df = pd.read_excel("D:\index\python4-5pm\Titanic.xlsx")

In [1792]:
df

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [1793]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [1794]:
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [1795]:
type(df)

pandas.core.frame.DataFrame

In [1796]:
type(df['Age'])

pandas.core.series.Series

In [1797]:
df['Age'].dtype

dtype('float64')

In [1798]:
df['Name'].dtype

dtype('O')

In [1799]:
df['Embarked'].dtype

dtype('O')

In [1800]:
df[['Age','Name']]

      Age                                               Name
0    22.0                            Braund, Mr. Owen Harris
1    38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...
2    26.0                             Heikkinen, Miss. Laina
3    35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4    35.0                           Allen, Mr. William Henry
..    ...                                                ...
886  27.0                              Montvila, Rev. Juozas
887  19.0                       Graham, Miss. Margaret Edith
888   NaN           Johnston, Miss. Catherine Helen "Carrie"
889  26.0                              Behr, Mr. Karl Howell
890  32.0                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [1801]:
type(df[['Age','Name']])

pandas.core.frame.DataFrame

In [1802]:
df.describe()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Survived
count,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,2.308642,29.699118,0.523008,0.381594,32.204208,0.383838
std,257.353842,0.836071,14.526497,1.102743,0.806057,49.693429,0.486592
min,1.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,223.500000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,446.000000,3.000000,28.000000,0.000000,0.000000,14.454200,0.000000
75%,668.500000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,891.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

In [1803]:
df.dtypes[df.dtypes == "object"]

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [1804]:
df[df.dtypes[df.dtypes == "object"].index]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [1805]:
df[df.dtypes[df.dtypes == "object"].index].describe()

                       Name   Sex  Ticket Cabin Embarked
count                   891   891     891   204      889
unique                  891     2     681   147        3
top     Dooley, Mr. Patrick  male  347082    G6        S
freq                      1   577       7     4      644

In [1806]:
df[df.dtypes[df.dtypes == "float"].index].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [1807]:
df[df.dtypes[df.dtypes == "int"].index].describe()

       PassengerId      Pclass       SibSp       Parch    Survived
count   891.000000  891.000000  891.000000  891.000000  891.000000
mean    446.000000    2.308642    0.523008    0.381594    0.383838
std     257.353842    0.836071    1.102743    0.806057    0.486592
min       1.000000    1.000000    0.000000    0.000000    0.000000
25%     223.500000    2.000000    0.000000    0.000000    0.000000
50%     446.000000    3.000000    0.000000    0.000000    0.000000
75%     668.500000    3.000000    1.000000    0.000000    1.000000
max     891.000000    3.000000    8.000000    6.000000    1.000000

In [1808]:
df.describe()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Survived
count,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,2.308642,29.699118,0.523008,0.381594,32.204208,0.383838
std,257.353842,0.836071,14.526497,1.102743,0.806057,49.693429,0.486592
min,1.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,223.500000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,446.000000,3.000000,28.000000,0.000000,0.000000,14.454200,0.000000
75%,668.500000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,891.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

In [1809]:
df1=pd.read_csv("D:\index\python4-5pm\car_data1.csv")

In [1810]:
df1

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0

In [1811]:
df1.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [1812]:
df1[1:5]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [1813]:
df1[1:7]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
5,vitara brezza,2018,9.25,9.83,2071,Diesel,Dealer,Manual,0
6,ciaz,2015,6.75,8.12,18796,Petrol,Dealer,Manual,0

In [1814]:
df1[1:7:2]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
5,vitara brezza,2018,9.25,9.83,2071,Diesel,Dealer,Manual,0

In [1815]:
df1['Car_Name'][1:7]

1              sx4
2             ciaz
3          wagon r
4            swift
5    vitara brezza
6             ciaz
Name: Car_Name, dtype: object

In [1816]:
df1

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0

In [1817]:
d ={"key":"value"}

In [1818]:
d ['age']= 21

In [1819]:
d

{'key': 'value', 'age': 21}

In [1820]:
df1=pd.read_csv("D:\index\python4-5pm\car_data1.csv")

In [1936]:
df1

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Differnce
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,2025,11
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,2025,12
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,2025,8
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,2025,14
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,2025,11
...,...,...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0,2025,9
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0,2025,10
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0,2025,16
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0,2025,8
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0,2025,9

In [1821]:
df1["Current_Year"]= 2025

In [1822]:
df1

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,2025
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,2025
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,2025
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,2025
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,2025
...,...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0,2025
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0,2025
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0,2025
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0,2025
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0,2025

In [1823]:
df1.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,2025
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,2025
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,2025
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,2025
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,2025

In [1824]:
df1['Current_Year']-df1['Year']

0      11
1      12
2       8
3      14
4      11
       ..
296     9
297    10
298    16
299     8
300     9
Length: 301, dtype: int64

In [1825]:
df1['Differnce']=df1['Current_Year']-df1['Year']

In [1826]:
df1

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Differnce
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,2025,11
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,2025,12
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,2025,8
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,2025,14
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,2025,11
...,...,...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0,2025,9
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0,2025,10
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0,2025,16
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0,2025,8
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0,2025,9

In [1827]:
df1.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Differnce
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,2025,11
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,2025,12
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,2025,8
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,2025,14
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,2025,11

In [1828]:
df1.isnull()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Differnce
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
296,False,False,False,False,False,False,False,False,False,False,False
297,False,False,False,False,False,False,False,False,False,False,False
298,False,False,False,False,False,False,False,False,False,False,False
299,False,False,False,False,False,False,False,False,False,False,False
300,False,False,False,False,False,False,False,False,False,False,False

In [1829]:
df1.isnull().sum()

Car_Name         0
Year             0
Selling_Price    0
Present_Price    0
Kms_Driven       0
Fuel_Type        0
Seller_Type      0
Transmission     0
Owner            0
Current_Year     0
Differnce        0
dtype: int64

In [1830]:
df

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [1831]:
df.isnull().sum()

PassengerId      0
Name             0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Survived         0
dtype: int64

In [1832]:
df1.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Differnce
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,2025,11
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,2025,12
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,2025,8
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,2025,14
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,2025,11

In [1833]:
max(df1['Kms_Driven'])

500000

In [1937]:
df1['Kms_Driven']==max(df1['Kms_Driven'])

0      False
1      False
2      False
3      False
4      False
       ...
296    False
297    False
298    False
299    False
300    False
Name: Kms_Driven, Length: 301, dtype: bool

In [1835]:
df1[df1['Kms_Driven']==max(df1['Kms_Driven'])]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Differnce
196,Activa 3g,2008,0.17,0.52,500000,Petrol,Individual,Automatic,0,2025,17

In [1836]:
df1[df1['Kms_Driven']==max(df1['Kms_Driven'])]['Year']

196    2008
Name: Year, dtype: int64

In [1837]:
df1[df1['Kms_Driven']==max(df1['Kms_Driven'])]['Car_Name']

196    Activa 3g
Name: Car_Name, dtype: object

In [1838]:
df1[df1['Year']==2014]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Differnce
0,ritz,2014,3.35,5.590,27000,Petrol,Dealer,Manual,0,2025,11
4,swift,2014,4.60,6.870,42450,Diesel,Dealer,Manual,0,2025,11
23,alto k10,2014,2.50,3.460,45280,Petrol,Dealer,Manual,0,2025,11
32,swift,2014,4.95,7.490,39000,Diesel,Dealer,Manual,0,2025,11
33,ertiga,2014,6.00,9.950,45000,Diesel,Dealer,Manual,0,2025,11
34,dzire,2014,5.50,8.060,45000,Diesel,Dealer,Manual,0,2025,11
41,alto k10,2014,2.55,3.980,46706,Petrol,Dealer,Manual,0,2025,11
43,dzire,2014,5.50,8.060,45780,Diesel,Dealer,Manual,0,2025,11
45,ciaz,2014,7.50,12.040,15000,Petrol,Dealer,Automatic,0,2025,11
58,etios g,2014,4.10,6.800,39485,Petrol,Dealer,Manual,1,2025,11
59,fortuner,2014,19.99,35.960,41000,Diesel,Dealer,Automatic,0,2025,11
62,fortuner,2014,18.75,35.960,78000,Diesel,Dealer,Automatic,0,2025,11
65,etios liva,2014,4.75,6.950,45000,Diesel,Dealer,Manual,0,2025,11
70,etios liva,2014,3.95,6.760,71000,Diesel,Dealer,Manual,0,2025,11
74,etios cross,2014,4.90,8.930,83000,Diesel,Dealer,Manual,0,2025,11
89,etios g,2014,4.75,6.760,40000,Petrol,Dealer,Manual,0,2025,11
91,innova,2014,11.25,16.090,58242,Diesel,Dealer,Manual,0,2025,11
106,Hyosung GT250R,2014,1.35,3.450,16500,Petrol,Individual,Manual,1,2025,11
112,KTM 390 Duke,2014,1.15,2.400,7000,Petrol,Individual,Manual,0,2025,11
136,Honda CBR 150,2014,0.65,1.200,23500,Petrol,Individual,Manual,0,2025,11
144,Bajaj Pulsar NS 200,2014,0.60,0.990,25000,Petrol,Individual,Manual,0,2025,11
146,Hero Extreme,2014,0.55,0.787,15000,Petrol,Individual,Manual,0,2025,11
154,Yamaha Fazer,2014,0.50,0.880,8000,Petrol,Individual,Manual,0,2025,11
161,TVS Apache RTR 180,2014,0.45,0.826,23000,Petrol,Individual,Manual,0,2025,11
167,TVS Apache RTR 160,2014,0.42,0.810,42000,Petrol,Individual,Manual,0,2025,11
172,Bajaj Pulsar 135 LS,2014,0.40,0.640,13700,Petrol,Individual,Manual,0,2025,11
178,TVS Jupyter,2014,0.35,0.520,19000,Petrol,Individual,Automatic,0,2025,11
218,verna,2014,6.45,9.400,45078,Petrol,Dealer,Manual,0,2025,11
222,i20,2014,6.00,7.600,77632,Diesel,Dealer,Manual,0,2025,11
242,xcent,2014,4.40,7.130,34000,Petrol,Dealer,Manual,0,2025,11
253,city,2014,7.20,9.900,48000,Diesel,Dealer,Manual,0,2025,11
259,amaze,2014,3.90,7.000,36054,Petrol,Dealer,Manual,0,2025,11
266,amaze,2014,3.65,7.000,35000,Petrol,Dealer,Manual,0,2025,11
274,brio,2014,5.30,6.800,16500,Petrol,Dealer,Manual,0,2025,11
279,city,2014,6.25,13.600,40126,Petrol,Dealer,Manual,0,2025,11
282,city,2014,8.25,14.000,63000,Diesel,Dealer,Manual,0,2025,11
290,amaze,2014,4.50,6.400,19000,Petrol,Dealer,Manual,0,2025,11
294,amaze,2014,3.75,6.800,33019,Petrol,Dealer,Manual,0,2025,11

In [1839]:
df1[df1['Year']==2014].shape

(38, 11)

In [1840]:
len(df1[df1['Year']==2014])

38

In [1841]:
df1.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Differnce
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,2025,11
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,2025,12
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,2025,8
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,2025,14
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,2025,11

In [1842]:
(df1['Year']<2014) & (df1['Kms_Driven']<70000)

0      False
1       True
2      False
3       True
4      False
       ...
296    False
297    False
298    False
299    False
300    False
Length: 301, dtype: bool

In [1843]:
df1[(df1['Year']<2014) & (df1['Kms_Driven']<7000)]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Differnce
3,wagon r,2011,2.85,4.150,5200,Petrol,Dealer,Manual,0,2025,14
119,Royal Enfield Thunder 500,2013,1.05,1.900,5400,Petrol,Individual,Manual,0,2025,12
121,Royal Enfield Thunder 350,2011,1.05,1.500,6900,Petrol,Individual,Manual,0,2025,14
150,TVS Apache RTR 180,2011,0.50,0.826,6000,Petrol,Individual,Manual,0,2025,14
170,Yamaha FZ S,2012,0.40,0.830,5500,Petrol,Individual,Manual,0,2025,13
185,Suzuki Access 125,2008,0.25,0.580,1900,Petrol,Individual,Automatic,0,2025,17

In [1844]:
df2 = pd.read_csv("D:\daily_total_births.csv")

In [1845]:
df2

           Date  Births
0    1959-01-01      35
1    1959-01-02      32
2    1959-01-03      30
3    1959-01-04      31
4    1959-01-05      44
..          ...     ...
360  1959-12-27      37
361  1959-12-28      52
362  1959-12-29      48
363  1959-12-30      55
364  1959-12-31      50

[365 rows x 2 columns]

In [1846]:
df2.head()

         Date  Births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44

In [1847]:
df2.tail()

           Date  Births
360  1959-12-27      37
361  1959-12-28      52
362  1959-12-29      48
363  1959-12-30      55
364  1959-12-31      50

In [1848]:
df2.shape

(365, 2)

In [1849]:
df2.isnull().sum()

Date      0
Births    0
dtype: int64

In [1850]:
df2.describe()

           Births
count  365.000000
mean    41.980822
std      7.348257
min     23.000000
25%     37.000000
50%     42.000000
75%     46.000000
max     73.000000

In [1851]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    365 non-null    object
 1   Births  365 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.8+ KB

In [1852]:
date = pd.to_datetime(df2['Date'])

In [1853]:
date

0     1959-01-01
1     1959-01-02
2     1959-01-03
3     1959-01-04
4     1959-01-05
         ...
360   1959-12-27
361   1959-12-28
362   1959-12-29
363   1959-12-30
364   1959-12-31
Name: Date, Length: 365, dtype: datetime64[ns]

In [1854]:
df2.head()

         Date  Births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44

In [1855]:
df2['coverted_date'] = date = pd.to_datetime(df2['Date'])

In [1856]:
df2

           Date  Births coverted_date
0    1959-01-01      35    1959-01-01
1    1959-01-02      32    1959-01-02
2    1959-01-03      30    1959-01-03
3    1959-01-04      31    1959-01-04
4    1959-01-05      44    1959-01-05
..          ...     ...           ...
360  1959-12-27      37    1959-12-27
361  1959-12-28      52    1959-12-28
362  1959-12-29      48    1959-12-29
363  1959-12-30      55    1959-12-30
364  1959-12-31      50    1959-12-31

[365 rows x 3 columns]

In [1857]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 365 entries, 0 to 364
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           365 non-null    object
 1   Births         365 non-null    int64
 2   coverted_date  365 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 8.7+ KB

In [1858]:
df2.head()

         Date  Births coverted_date
0  1959-01-01      35    1959-01-01
1  1959-01-02      32    1959-01-02
2  1959-01-03      30    1959-01-03
3  1959-01-04      31    1959-01-04
4  1959-01-05      44    1959-01-05

In [1859]:
df2['Year'] = df2['coverted_date'].dt.year

In [1860]:
df2.head()

         Date  Births coverted_date  Year
0  1959-01-01      35    1959-01-01  1959
1  1959-01-02      32    1959-01-02  1959
2  1959-01-03      30    1959-01-03  1959
3  1959-01-04      31    1959-01-04  1959
4  1959-01-05      44    1959-01-05  1959

In [1861]:
df2['Month'] = df2['coverted_date'].dt.month

In [1862]:
df2

           Date  Births coverted_date  Year  Month
0    1959-01-01      35    1959-01-01  1959      1
1    1959-01-02      32    1959-01-02  1959      1
2    1959-01-03      30    1959-01-03  1959      1
3    1959-01-04      31    1959-01-04  1959      1
4    1959-01-05      44    1959-01-05  1959      1
..          ...     ...           ...   ...    ...
360  1959-12-27      37    1959-12-27  1959     12
361  1959-12-28      52    1959-12-28  1959     12
362  1959-12-29      48    1959-12-29  1959     12
363  1959-12-30      55    1959-12-30  1959     12
364  1959-12-31      50    1959-12-31  1959     12

[365 rows x 5 columns]

In [1863]:
df2['week'] = df2['coverted_date'].dt.isocalendar().week

In [1864]:
df2

           Date  Births coverted_date  Year  Month  week
0    1959-01-01      35    1959-01-01  1959      1     1
1    1959-01-02      32    1959-01-02  1959      1     1
2    1959-01-03      30    1959-01-03  1959      1     1
3    1959-01-04      31    1959-01-04  1959      1     1
4    1959-01-05      44    1959-01-05  1959      1     2
..          ...     ...           ...   ...    ...   ...
360  1959-12-27      37    1959-12-27  1959     12    52
361  1959-12-28      52    1959-12-28  1959     12    53
362  1959-12-29      48    1959-12-29  1959     12    53
363  1959-12-30      55    1959-12-30  1959     12    53
364  1959-12-31      50    1959-12-31  1959     12    53

[365 rows x 6 columns]

In [1865]:
df2['Month'].value_counts()

Month
1     31
3     31
7     31
5     31
12    31
10    31
8     31
4     30
9     30
6     30
11    30
2     28
Name: count, dtype: int64

In [1866]:
df2.head()

         Date  Births coverted_date  Year  Month  week
0  1959-01-01      35    1959-01-01  1959      1     1
1  1959-01-02      32    1959-01-02  1959      1     1
2  1959-01-03      30    1959-01-03  1959      1     1
3  1959-01-04      31    1959-01-04  1959      1     1
4  1959-01-05      44    1959-01-05  1959      1     2

In [1867]:
df2 = df2.drop('week',axis=1)

In [1868]:
df2

           Date  Births coverted_date  Year  Month
0    1959-01-01      35    1959-01-01  1959      1
1    1959-01-02      32    1959-01-02  1959      1
2    1959-01-03      30    1959-01-03  1959      1
3    1959-01-04      31    1959-01-04  1959      1
4    1959-01-05      44    1959-01-05  1959      1
..          ...     ...           ...   ...    ...
360  1959-12-27      37    1959-12-27  1959     12
361  1959-12-28      52    1959-12-28  1959     12
362  1959-12-29      48    1959-12-29  1959     12
363  1959-12-30      55    1959-12-30  1959     12
364  1959-12-31      50    1959-12-31  1959     12

[365 rows x 5 columns]

In [1869]:
df2 = df2.drop(1)

In [1870]:
df2

           Date  Births coverted_date  Year  Month
0    1959-01-01      35    1959-01-01  1959      1
2    1959-01-03      30    1959-01-03  1959      1
3    1959-01-04      31    1959-01-04  1959      1
4    1959-01-05      44    1959-01-05  1959      1
5    1959-01-06      29    1959-01-06  1959      1
..          ...     ...           ...   ...    ...
360  1959-12-27      37    1959-12-27  1959     12
361  1959-12-28      52    1959-12-28  1959     12
362  1959-12-29      48    1959-12-29  1959     12
363  1959-12-30      55    1959-12-30  1959     12
364  1959-12-31      50    1959-12-31  1959     12

[364 rows x 5 columns]

In [1871]:
df2.head()

         Date  Births coverted_date  Year  Month
0  1959-01-01      35    1959-01-01  1959      1
2  1959-01-03      30    1959-01-03  1959      1
3  1959-01-04      31    1959-01-04  1959      1
4  1959-01-05      44    1959-01-05  1959      1
5  1959-01-06      29    1959-01-06  1959      1

In [1872]:
df2.loc[2]

Date                      1959-01-03
Births                            30
coverted_date    1959-01-03 00:00:00
Year                            1959
Month                              1
Name: 2, dtype: object

In [1873]:
df2.loc[[2,3]]

         Date  Births coverted_date  Year  Month
2  1959-01-03      30    1959-01-03  1959      1
3  1959-01-04      31    1959-01-04  1959      1

In [1874]:
df2.loc[[50,23]]

          Date  Births coverted_date  Year  Month
50  1959-02-20      48    1959-02-20  1959      2
23  1959-01-24      32    1959-01-24  1959      1

In [1875]:
df2.loc[2:7]

         Date  Births coverted_date  Year  Month
2  1959-01-03      30    1959-01-03  1959      1
3  1959-01-04      31    1959-01-04  1959      1
4  1959-01-05      44    1959-01-05  1959      1
5  1959-01-06      29    1959-01-06  1959      1
6  1959-01-07      45    1959-01-07  1959      1
7  1959-01-08      43    1959-01-08  1959      1

In [1876]:
df2.loc[2:7:2]

         Date  Births coverted_date  Year  Month
2  1959-01-03      30    1959-01-03  1959      1
4  1959-01-05      44    1959-01-05  1959      1
6  1959-01-07      45    1959-01-07  1959      1

In [1877]:
df2.loc[2:7,['Date','Births','coverted_date']]

         Date  Births coverted_date
2  1959-01-03      30    1959-01-03
3  1959-01-04      31    1959-01-04
4  1959-01-05      44    1959-01-05
5  1959-01-06      29    1959-01-06
6  1959-01-07      45    1959-01-07
7  1959-01-08      43    1959-01-08

In [1878]:
df2.iloc[2:7,0:3]

         Date  Births coverted_date
3  1959-01-04      31    1959-01-04
4  1959-01-05      44    1959-01-05
5  1959-01-06      29    1959-01-06
6  1959-01-07      45    1959-01-07
7  1959-01-08      43    1959-01-08

In [1879]:
df.shape

(891, 12)

In [1880]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [1881]:
df.isnull().sum()

PassengerId      0
Name             0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Survived         0
dtype: int64

#mean mode medain zero fill drop exact value

In [1882]:
df.dropna()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
6,7,"McCarthy, Mr. Timothy J",1,male,54.0,0,0,17463,51.8625,E46,S,0
10,11,"Sandstrom, Miss. Marguerite Rut",3,female,4.0,1,1,PP 9549,16.7000,G6,S,1
11,12,"Bonnell, Miss. Elizabeth",1,female,58.0,0,0,113783,26.5500,C103,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",1,female,47.0,1,1,11751,52.5542,D35,S,1
872,873,"Carlsson, Mr. Frans Olof",1,male,33.0,0,0,695,5.0000,B51 B53 B55,S,0
879,880,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",1,female,56.0,0,1,11767,83.1583,C50,C,1
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1

In [1883]:
df.dropna(axis=1)

,PassengerId,Name,Pclass,Sex,SibSp,Parch,Ticket,Fare,Survived
0,1,"Braund, Mr. Owen Harris",3,male,1,0,A/5 21171,7.2500,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,1,0,PC 17599,71.2833,1
2,3,"Heikkinen, Miss. Laina",3,female,0,0,STON/O2. 3101282,7.9250,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,1,0,113803,53.1000,1
4,5,"Allen, Mr. William Henry",3,male,0,0,373450,8.0500,0
...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,0,0,211536,13.0000,0
887,888,"Graham, Miss. Margaret Edith",1,female,0,0,112053,30.0000,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,1,2,W./C. 6607,23.4500,0
889,890,"Behr, Mr. Karl Howell",1,male,0,0,111369,30.0000,1
890,891,"Dooley, Mr. Patrick",3,male,0,0,370376,7.7500,0

In [1884]:
df.dropna(thresh=3)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [1885]:
df.fillna(value=df['Age'].mean())

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.000000,1,0,A/5 21171,7.2500,29.699118,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.000000,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.000000,0,0,STON/O2. 3101282,7.9250,29.699118,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.000000,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.000000,0,0,373450,8.0500,29.699118,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.000000,0,0,211536,13.0000,29.699118,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.000000,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,29.699118,1,2,W./C. 6607,23.4500,29.699118,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.000000,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.000000,0,0,370376,7.7500,29.699118,Q,0

In [1886]:
df.dropna(thresh=1)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [1887]:
df.fillna(4)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,4,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,4,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,4,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,4,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,4.0,1,2,W./C. 6607,23.4500,4,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,4,Q,0

In [1888]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [1889]:
df.fillna(value=df['Age'].mean())

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.000000,1,0,A/5 21171,7.2500,29.699118,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.000000,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.000000,0,0,STON/O2. 3101282,7.9250,29.699118,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.000000,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.000000,0,0,373450,8.0500,29.699118,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.000000,0,0,211536,13.0000,29.699118,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.000000,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,29.699118,1,2,W./C. 6607,23.4500,29.699118,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.000000,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.000000,0,0,370376,7.7500,29.699118,Q,0

In [1890]:
data = {
    'name':['abc','def','ghi','hij'],
    'salary':[100,200,300,400],
    'mail_id':['abc@gmail.com','def@gmail.com','kgf@gmail.com','mno@gmail.com'],
    'addr':['mum','pune','mum','delhi']
}

In [1891]:
df3 = pd.DataFrame(data,index=[4,5,6,7])

In [1892]:
df3

  name  salary        mail_id   addr
4  abc     100  abc@gmail.com    mum
5  def     200  def@gmail.com   pune
6  ghi     300  kgf@gmail.com    mum
7  hij     400  mno@gmail.com  delhi

In [1893]:
pd.DataFrame

pandas.core.frame.DataFrame

In [1894]:
df3 = pd.DataFrame(data)

In [1895]:
df3

  name  salary        mail_id   addr
0  abc     100  abc@gmail.com    mum
1  def     200  def@gmail.com   pune
2  ghi     300  kgf@gmail.com    mum
3  hij     400  mno@gmail.com  delhi

In [1896]:
data1 = {
    'pf_num':[234,456,234,566],
    'income_tax':[2334,5356,7478,3887],
    'mobile_num':[2334,5567,7765,5554],
    'course':['DS','DA','PFS','FS']
}

In [1897]:
df4 = pd.DataFrame(data1)

In [1898]:
df4

   pf_num  income_tax  mobile_num course
0     234        2334        2334     DS
1     456        5356        5567     DA
2     234        7478        7765    PFS
3     566        3887        5554     FS

In [1899]:
df3

  name  salary        mail_id   addr
0  abc     100  abc@gmail.com    mum
1  def     200  def@gmail.com   pune
2  ghi     300  kgf@gmail.com    mum
3  hij     400  mno@gmail.com  delhi

In [1900]:
df4

   pf_num  income_tax  mobile_num course
0     234        2334        2334     DS
1     456        5356        5567     DA
2     234        7478        7765    PFS
3     566        3887        5554     FS

In [1901]:
df3+df4

  addr course  income_tax mail_id  mobile_num name  pf_num  salary
0  NaN    NaN         NaN     NaN         NaN  NaN     NaN     NaN
1  NaN    NaN         NaN     NaN         NaN  NaN     NaN     NaN
2  NaN    NaN         NaN     NaN         NaN  NaN     NaN     NaN
3  NaN    NaN         NaN     NaN         NaN  NaN     NaN     NaN

In [1902]:
pd.concat([df3,df4])

  name  salary        mail_id   addr  pf_num  income_tax  mobile_num course
0  abc   100.0  abc@gmail.com    mum     NaN         NaN         NaN    NaN
1  def   200.0  def@gmail.com   pune     NaN         NaN         NaN    NaN
2  ghi   300.0  kgf@gmail.com    mum     NaN         NaN         NaN    NaN
3  hij   400.0  mno@gmail.com  delhi     NaN         NaN         NaN    NaN
0  NaN     NaN            NaN    NaN   234.0      2334.0      2334.0     DS
1  NaN     NaN            NaN    NaN   456.0      5356.0      5567.0     DA
2  NaN     NaN            NaN    NaN   234.0      7478.0      7765.0    PFS
3  NaN     NaN            NaN    NaN   566.0      3887.0      5554.0     FS

In [1903]:
pd.concat([df3,df4])

  name  salary        mail_id   addr  pf_num  income_tax  mobile_num course
0  abc   100.0  abc@gmail.com    mum     NaN         NaN         NaN    NaN
1  def   200.0  def@gmail.com   pune     NaN         NaN         NaN    NaN
2  ghi   300.0  kgf@gmail.com    mum     NaN         NaN         NaN    NaN
3  hij   400.0  mno@gmail.com  delhi     NaN         NaN         NaN    NaN
0  NaN     NaN            NaN    NaN   234.0      2334.0      2334.0     DS
1  NaN     NaN            NaN    NaN   456.0      5356.0      5567.0     DA
2  NaN     NaN            NaN    NaN   234.0      7478.0      7765.0    PFS
3  NaN     NaN            NaN    NaN   566.0      3887.0      5554.0     FS

In [1904]:
pd.concat([df3,df4],axis=1)

  name  salary        mail_id   addr  pf_num  income_tax  mobile_num course
0  abc     100  abc@gmail.com    mum     234        2334        2334     DS
1  def     200  def@gmail.com   pune     456        5356        5567     DA
2  ghi     300  kgf@gmail.com    mum     234        7478        7765    PFS
3  hij     400  mno@gmail.com  delhi     566        3887        5554     FS

In [1905]:
data2 = {'0': ['abc', 'bcd', 'efg', 'hij'],
'1'  :[100, 200, 300, 400],
'2' :['abc@gmail.com','def@gmail.com','kgf@gmail.com','mno@gmail.com'],
'3' :['mum','pune','mum','delhi']
}           

data3 = {'0':[234,456,234,566],
'1' :[2334,5356,7478,3887],
'2' :[2334,5567,7765,5554],
'3' :['ds','bigdata','python','web']
}

In [1906]:
df5 = pd.DataFrame(data2)
df6 = pd.DataFrame(data3,index=[4,5,6,7])

In [1907]:
df5

     0    1              2      3
0  abc  100  abc@gmail.com    mum
1  bcd  200  def@gmail.com   pune
2  efg  300  kgf@gmail.com    mum
3  hij  400  mno@gmail.com  delhi

In [1908]:
df6

     0     1     2        3
4  234  2334  2334       ds
5  456  5356  5567  bigdata
6  234  7478  7765   python
7  566  3887  5554      web

In [1909]:
pd.concat([df5,df6])

     0     1              2        3
0  abc   100  abc@gmail.com      mum
1  bcd   200  def@gmail.com     pune
2  efg   300  kgf@gmail.com      mum
3  hij   400  mno@gmail.com    delhi
4  234  2334           2334       ds
5  456  5356           5567  bigdata
6  234  7478           7765   python
7  566  3887           5554      web

In [1910]:
pd.concat([df5,df6],axis=1)

     0      1              2      3      0       1       2        3
0  abc  100.0  abc@gmail.com    mum    NaN     NaN     NaN      NaN
1  bcd  200.0  def@gmail.com   pune    NaN     NaN     NaN      NaN
2  efg  300.0  kgf@gmail.com    mum    NaN     NaN     NaN      NaN
3  hij  400.0  mno@gmail.com  delhi    NaN     NaN     NaN      NaN
4  NaN    NaN            NaN    NaN  234.0  2334.0  2334.0       ds
5  NaN    NaN            NaN    NaN  456.0  5356.0  5567.0  bigdata
6  NaN    NaN            NaN    NaN  234.0  7478.0  7765.0   python
7  NaN    NaN            NaN    NaN  566.0  3887.0  5554.0      web

In [1911]:
data7 = {'emp_id' : [101,102,103,104],
'salary' : [222,555,666,897],
'pf' : [23,34,56,78]
}

data8 = {'emp_id' : [101,102,103,104],
'mobile_no' : [2344,5677,8765,7865],
'house_no' : [345,567,876,456]
}

In [1912]:
df7 = pd.DataFrame(data7)
df8 = pd.DataFrame(data8)

In [1913]:
df7

   emp_id  salary  pf
0     101     222  23
1     102     555  34
2     103     666  56
3     104     897  78

In [1914]:
df8

   emp_id  mobile_no  house_no
0     101       2344       345
1     102       5677       567
2     103       8765       876
3     104       7865       456

In [1915]:
pd.merge(df7,df8)

   emp_id  salary  pf  mobile_no  house_no
0     101     222  23       2344       345
1     102     555  34       5677       567
2     103     666  56       8765       876
3     104     897  78       7865       456

In [1916]:
pd.merge(df7,df8, how='left')

   emp_id  salary  pf  mobile_no  house_no
0     101     222  23       2344       345
1     102     555  34       5677       567
2     103     666  56       8765       876
3     104     897  78       7865       456

In [1917]:
pd.merge(df7,df8, how='left',on='emp_id')

   emp_id  salary  pf  mobile_no  house_no
0     101     222  23       2344       345
1     102     555  34       5677       567
2     103     666  56       8765       876
3     104     897  78       7865       456

In [1918]:
data9 = {'emp_id1' : [101,102,103,104],
'salary1' : [222,555,666,897],
'pf1' : [23,34,56,78]
}

data10 = {'emp_id2' : [101,102,103,104],
'mobile_no2' : [2344,5677,8765,7865],
'house_no2' : [345,567,876,456]
}

In [1919]:
df9 = pd.DataFrame(data9)
df10 = pd.DataFrame(data10)

In [1920]:
df9

   emp_id1  salary1  pf1
0      101      222   23
1      102      555   34
2      103      666   56
3      104      897   78

In [1921]:
df10

   emp_id2  mobile_no2  house_no2
0      101        2344        345
1      102        5677        567
2      103        8765        876
3      104        7865        456

In [1922]:
pd.merge(df9,df10 ,left_on='emp_id1',right_on='emp_id2')

   emp_id1  salary1  pf1  emp_id2  mobile_no2  house_no2
0      101      222   23      101        2344        345
1      102      555   34      102        5677        567
2      103      666   56      103        8765        876
3      104      897   78      104        7865        456

In [1923]:
data11 = {'emp_id' : [101,102,103,104],
'salary' : [222,555,666,897],
'pf' : [23,34,56,78]
}

data12 = {'emp_id' : [101,102,104,105,123],
'mobile_no' : [2344,5677,8765,7865,3455],
'house_no' : [345,567,876,456,678]
}

In [1924]:
df11 = pd.DataFrame(data11)
df12 = pd.DataFrame(data12)

In [1925]:
df11

   emp_id  salary  pf
0     101     222  23
1     102     555  34
2     103     666  56
3     104     897  78

In [1926]:
df12

   emp_id  mobile_no  house_no
0     101       2344       345
1     102       5677       567
2     104       8765       876
3     105       7865       456
4     123       3455       678

In [1927]:
pd.merge(df11,df12)

   emp_id  salary  pf  mobile_no  house_no
0     101     222  23       2344       345
1     102     555  34       5677       567
2     104     897  78       8765       876

In [1928]:
data13 = {'emp_id1' : [101,102,103,104],
'salary1' : [222,555,666,897],
'pf1' : [23,34,56,78]
}

data14 = {'emp_id2' : [101,102,104,105,123],
'mobile_no2' : [2344,5677,8765,7865,3455],
'house_no2' : [345,567,876,456,678]
}

In [1932]:
df13 = pd.DataFrame(data13, index=['a','b','c','d',])
df14 = pd.DataFrame(data14, index=['a','b','d','e','f'])

In [1930]:
df13

   emp_id1  salary1  pf1
a      101      222   23
b      102      555   34
c      103      666   56
d      104      897   78

In [1933]:
df14

   emp_id2  mobile_no2  house_no2
a      101        2344        345
b      102        5677        567
d      104        8765        876
e      105        7865        456
f      123        3455        678

In [1934]:
df13.join(df14)

   emp_id1  salary1  pf1  emp_id2  mobile_no2  house_no2
a      101      222   23    101.0      2344.0      345.0
b      102      555   34    102.0      5677.0      567.0
c      103      666   56      NaN         NaN        NaN
d      104      897   78    104.0      8765.0      876.0

In [1935]:
df14.join(df13)

   emp_id2  mobile_no2  house_no2  emp_id1  salary1   pf1
a      101        2344        345    101.0    222.0  23.0
b      102        5677        567    102.0    555.0  34.0
d      104        8765        876    104.0    897.0  78.0
e      105        7865        456      NaN      NaN   NaN
f      123        3455        678      NaN      NaN   NaN

In [ ]:
df

In [1938]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [ ]:
df1

In [1939]:
df1.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Differnce
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,2025,11
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,2025,12
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,2025,8
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,2025,14
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,2025,11

In [ ]:
df1["Present_Price"]>5

In [ ]:
def review(x):
    if x>5:
        return("high")
    else:   
        return("low")

In [1940]:
review(4.59)

'low'

In [1941]:
df1['Review'] = df1['Present_Price'].apply(review)

In [1942]:
df1.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Differnce,Review
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,2025,11,high
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,2025,12,high
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,2025,8,high
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,2025,14,low
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,2025,11,high

In [ ]:
df1['Present_Price'] = df1['Present_Price'].apply(review)

In [1943]:
df1

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Differnce,Review
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,2025,11,high
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,2025,12,high
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,2025,8,high
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,2025,14,low
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,2025,11,high
...,...,...,...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0,2025,9,high
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0,2025,10,high
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0,2025,16,high
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0,2025,8,high
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0,2025,9,high

In [ ]:
df1['Car_len'] = df1['Car_Name'].apply(len)

In [ ]:
df1

In [1944]:
df1.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Differnce,Review
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,2025,11,high
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,2025,12,high
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,2025,8,high
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,2025,14,low
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,2025,11,high

In [1945]:
for i in df:
     print(i)

PassengerId
Name
Pclass
Sex
Age
SibSp
Parch
Ticket
Fare
Cabin
Embarked
Survived

In [1946]:
for i in df:
     print(df1)

    Car_Name  Year  Selling_Price  Present_Price  Kms_Driven Fuel_Type  \
0       ritz  2014           3.35           5.59       27000    Petrol
1        sx4  2013           4.75           9.54       43000    Diesel
2       ciaz  2017           7.25           9.85        6900    Petrol
3    wagon r  2011           2.85           4.15        5200    Petrol
4      swift  2014           4.60           6.87       42450    Diesel
..       ...   ...            ...            ...         ...       ...
296     city  2016           9.50          11.60       33988    Diesel
297     brio  2015           4.00           5.90       60000    Petrol
298     city  2009           3.35          11.00       87934    Petrol
299     city  2017          11.50          12.50        9000    Diesel
300     brio  2016           5.30           5.90        5464    Petrol

    Seller_Type Transmission  Owner  Current_Year  Differnce Review
0        Dealer       Manual      0          2025         11   high
1        Dealer       Manual      0          2025         12   high
2        Dealer       Manual      0          2025          8   high
3        Dealer       Manual      0          2025         14    low
4        Dealer       Manual      0          2025         11   high
..          ...          ...    ...           ...        ...    ...
296      Dealer       Manual      0          2025          9   high
297      Dealer       Manual      0          2025         10   high
298      Dealer       Manual      0          2025         16   high
299      Dealer       Manual      0          2025          8   high
300      Dealer       Manual      0          2025          9   high

[301 rows x 12 columns]
    Car_Name  Year  Selling_Price  Present_Price  Kms_Driven Fuel_Type  \
0       ritz  2014           3.35           5.59       27000    Petrol
1        sx4  2013           4.75           9.54       43000    Diesel
2       ciaz  2017           7.25           9.85        6900    Petrol
3    wagon r  2011           2.85           4.15        5200    Petrol
4      swift  2014           4.60           6.87       42450    Diesel
..       ...   ...            ...            ...         ...       ...
296     city  2016           9.50          11.60       33988    Diesel
297     brio  2015           4.00           5.90       60000    Petrol
298     city  2009           3.35          11.00       87934    Petrol
299     city  2017          11.50          12.50        9000    Diesel
300     brio  2016           5.30           5.90        5464    Petrol

    Seller_Type Transmission  Owner  Current_Year  Differnce Review
0        Dealer       Manual      0          2025         11   high
1        Dealer       Manual      0          2025         12   high
2        Dealer       Manual      0          2025          8   high
3        Dealer       Manual      0          2025         14    low
4        Dealer       Manual      0          2025         11   high
..          ...          ...    ...           ...        ...    ...
296      Dealer       Manual      0          2025          9   high
297      Dealer       Manual      0          2025         10   high
298      Dealer       Manual      0          2025         16   high
299      Dealer       Manual      0          2025          8   high
300      Dealer       Manual      0          2025          9   high

[301 rows x 12 columns]
    Car_Name  Year  Selling_Price  Present_Price  Kms_Driven Fuel_Type  \
0       ritz  2014           3.35           5.59       27000    Petrol
1        sx4  2013           4.75           9.54       43000    Diesel
2       ciaz  2017           7.25           9.85        6900    Petrol
3    wagon r  2011           2.85           4.15        5200    Petrol
4      swift  2014           4.60           6.87       42450    Diesel
..       ...   ...            ...            ...         ...       ...
296     city  2016           9.50          11.60       33988    Diesel
297     brio  2015           4.00           5.90       60000    Petrol
298     city  2009           3.35          11.00       87934    Petrol
299     city  2017          11.50          12.50        9000    Diesel
300     brio  2016           5.30           5.90        5464    Petrol

    Seller_Type Transmission  Owner  Current_Year  Differnce Review
0        Dealer       Manual      0          2025         11   high
1        Dealer       Manual      0          2025         12   high
2        Dealer       Manual      0          2025          8   high
3        Dealer       Manual      0          2025         14    low
4        Dealer       Manual      0          2025         11   high
..          ...          ...    ...           ...        ...    ...
296      Dealer       Manual      0          2025          9   high
297      Dealer       Manual      0          2025         10   high
298      Dealer       Manual      0          2025         16   high
299      Dealer       Manual      0          2025          8   high
300      Dealer       Manual      0          2025          9   high

[301 rows x 12 columns]
    Car_Name  Year  Selling_Price  Present_Price  Kms_Driven Fuel_Type  \
0       ritz  2014           3.35           5.59       27000    Petrol
1        sx4  2013           4.75           9.54       43000    Diesel
2       ciaz  2017           7.25           9.85        6900    Petrol
3    wagon r  2011           2.85           4.15        5200    Petrol
4      swift  2014           4.60           6.87       42450    Diesel
..       ...   ...            ...            ...         ...       ...
296     city  2016           9.50          11.60       33988    Diesel
297     brio  2015           4.00           5.90       60000    Petrol
298     city  2009           3.35          11.00       87934    Petrol
299     city  2017          11.50          12.50        9000    Diesel
300     brio  2016           5.30           5.90        5464    Petrol

    Seller_Type Transmission  Owner  Current_Year  Differnce Review
0        Dealer       Manual      0          2025         11   high
1        Dealer       Manual      0          2025         12   high
2        Dealer       Manual      0          2025          8   high
3        Dealer       Manual      0          2025         14    low
4        Dealer       Manual      0          2025         11   high
..          ...          ...    ...           ...        ...    ...
296      Dealer       Manual      0          2025          9   high
297      Dealer       Manual      0          2025         10   high
298      Dealer       Manual      0          2025         16   high
299      Dealer       Manual      0          2025          8   high
300      Dealer       Manual      0          2025          9   high

[301 rows x 12 columns]
    Car_Name  Year  Selling_Price  Present_Price  Kms_Driven Fuel_Type  \
0       ritz  2014           3.35           5.59       27000    Petrol
1        sx4  2013           4.75           9.54       43000    Diesel
2       ciaz  2017           7.25           9.85        6900    Petrol
3    wagon r  2011           2.85           4.15        5200    Petrol
4      swift  2014           4.60           6.87       42450    Diesel
..       ...   ...            ...            ...         ...       ...
296     city  2016           9.50          11.60       33988    Diesel
297     brio  2015           4.00           5.90       60000    Petrol
298     city  2009           3.35          11.00       87934    Petrol
299     city  2017          11.50          12.50        9000    Diesel
300     brio  2016           5.30           5.90        5464    Petrol

    Seller_Type Transmission  Owner  Current_Year  Differnce Review
0        Dealer       Manual      0          2025         11   high
1        Dealer       Manual      0          2025         12   high
2        Dealer       Manual      0          2025          8   high
3        Dealer       Manual      0          2025         14    low
4        Dealer       Manual      0          2025         11   high
..          ...          ...    ...           ...        ...    ...
296      Dealer       Manual      0          2025          9   high
297      Dealer       Manual      0          2025         10   high
298      Dealer       Manual      0          2025         16   high
299      Dealer       Manual      0          2025          8   high
300      Dealer       Manual      0          2025          9   high

[301 rows x 12 columns]
    Car_Name  Year  Selling_Price  Present_Price  Kms_Driven Fuel_Type  \
0       ritz  2014           3.35           5.59       27000    Petrol
1        sx4  2013           4.75           9.54       43000    Diesel
2       ciaz  2017           7.25           9.85        6900    Petrol
3    wagon r  2011           2.85           4.15        5200    Petrol
4      swift  2014           4.60           6.87       42450    Diesel
..       ...   ...            ...            ...         ...       ...
296     city  2016           9.50          11.60       33988    Diesel
297     brio  2015           4.00           5.90       60000    Petrol
298     city  2009           3.35          11.00       87934    Petrol
299     city  2017          11.50          12.50        9000    Diesel
300     brio  2016           5.30           5.90        5464    Petrol

    Seller_Type Transmission  Owner  Current_Year  Differnce Review
0        Dealer       Manual      0          2025         11   high
1        Dealer       Manual      0          2025         12   high
2        Dealer       Manual      0          2025          8   high
3        Dealer       Manual      0          2025         14    low
4        Dealer       Manual      0          2025         11   high
..          ...          ...    ...           ...        ...    ...
296      Dealer       Manual      0          2025          9   high
297      Dealer       Manual      0          2025         10   high
298      Dealer       Manual      0          2025         16   high
299      Dealer       Manual      0          2025          8   high
300      Dealer       Manual      0          2025          9   high

[301 rows x 12 columns]
    Car_Name  Year  Selling_Price  Present_Price  Kms_Driven Fuel_Type  \
0       ritz  2014           3.35           5.59       27000    Petrol
1        sx4  2013           4.75           9.54       43000    Diesel
2       ciaz  2017           7.25           9.85        6900    Petrol
3    wagon r  2011           2.85           4.15        5200    Petrol
4      swift  2014           4.60           6.87       42450    Diesel
..       ...   ...            ...            ...         ...       ...
296     city  2016           9.50          11.60       33988    Diesel
297     brio  2015           4.00           5.90       60000    Petrol
298     city  2009           3.35          11.00       87934    Petrol
299     city  2017          11.50          12.50        9000    Diesel
300     brio  2016           5.30           5.90        5464    Petrol

    Seller_Type Transmission  Owner  Current_Year  Differnce Review
0        Dealer       Manual      0          2025         11   high
1        Dealer       Manual      0          2025         12   high
2        Dealer       Manual      0          2025          8   high
3        Dealer       Manual      0          2025         14    low
4        Dealer       Manual      0          2025         11   high
..          ...          ...    ...           ...        ...    ...
296      Dealer       Manual      0          2025          9   high
297      Dealer       Manual      0          2025         10   high
298      Dealer       Manual      0          2025         16   high
299      Dealer       Manual      0          2025          8   high
300      Dealer       Manual      0          2025          9   high

[301 rows x 12 columns]
    Car_Name  Year  Selling_Price  Present_Price  Kms_Driven Fuel_Type  \
0       ritz  2014           3.35           5.59       27000    Petrol
1        sx4  2013           4.75           9.54       43000    Diesel
2       ciaz  2017           7.25           9.85        6900    Petrol
3    wagon r  2011           2.85           4.15        5200    Petrol
4      swift  2014           4.60           6.87       42450    Diesel
..       ...   ...            ...            ...         ...       ...
296     city  2016           9.50          11.60       33988    Diesel
297     brio  2015           4.00           5.90       60000    Petrol
298     city  2009           3.35          11.00       87934    Petrol
299     city  2017          11.50          12.50        9000    Diesel
300     brio  2016           5.30           5.90        5464    Petrol

    Seller_Type Transmission  Owner  Current_Year  Differnce Review
0        Dealer       Manual      0          2025         11   high
1        Dealer       Manual      0          2025         12   high
2        Dealer       Manual      0          2025          8   high
3        Dealer       Manual      0          2025         14    low
4        Dealer       Manual      0          2025         11   high
..          ...          ...    ...           ...        ...    ...
296      Dealer       Manual      0          2025          9   high
297      Dealer       Manual      0          2025         10   high
298      Dealer       Manual      0          2025         16   high
299      Dealer       Manual      0          2025          8   high
300      Dealer       Manual      0          2025          9   high

[301 rows x 12 columns]
    Car_Name  Year  Selling_Price  Present_Price  Kms_Driven Fuel_Type  \
0       ritz  2014           3.35           5.59       27000    Petrol
1        sx4  2013           4.75           9.54       43000    Diesel
2       ciaz  2017           7.25           9.85        6900    Petrol
3    wagon r  2011           2.85           4.15        5200    Petrol
4      swift  2014           4.60           6.87       42450    Diesel
..       ...   ...            ...            ...         ...       ...
296     city  2016           9.50          11.60       33988    Diesel
297     brio  2015           4.00           5.90       60000    Petrol
298     city  2009           3.35          11.00       87934    Petrol
299     city  2017          11.50          12.50        9000    Diesel
300     brio  2016           5.30           5.90        5464    Petrol

    Seller_Type Transmission  Owner  Current_Year  Differnce Review
0        Dealer       Manual      0          2025         11   high
1        Dealer       Manual      0          2025         12   high
2        Dealer       Manual      0          2025          8   high
3        Dealer       Manual      0          2025         14    low
4        Dealer       Manual      0          2025         11   high
..          ...          ...    ...           ...        ...    ...
296      Dealer       Manual      0          2025          9   high
297      Dealer       Manual      0          2025         10   high
298      Dealer       Manual      0          2025         16   high
299      Dealer       Manual      0          2025          8   high
300      Dealer       Manual      0          2025          9   high

[301 rows x 12 columns]
    Car_Name  Year  Selling_Price  Present_Price  Kms_Driven Fuel_Type  \
0       ritz  2014           3.35           5.59       27000    Petrol
1        sx4  2013           4.75           9.54       43000    Diesel
2       ciaz  2017           7.25           9.85        6900    Petrol
3    wagon r  2011           2.85           4.15        5200    Petrol
4      swift  2014           4.60           6.87       42450    Diesel
..       ...   ...            ...            ...         ...       ...
296     city  2016           9.50          11.60       33988    Diesel
297     brio  2015           4.00           5.90       60000    Petrol
298     city  2009           3.35          11.00       87934    Petrol
299     city  2017          11.50          12.50        9000    Diesel
300     brio  2016           5.30           5.90        5464    Petrol

    Seller_Type Transmission  Owner  Current_Year  Differnce Review
0        Dealer       Manual      0          2025         11   high
1        Dealer       Manual      0          2025         12   high
2        Dealer       Manual      0          2025          8   high
3        Dealer       Manual      0          2025         14    low
4        Dealer       Manual      0          2025         11   high
..          ...          ...    ...           ...        ...    ...
296      Dealer       Manual      0          2025          9   high
297      Dealer       Manual      0          2025         10   high
298      Dealer       Manual      0          2025         16   high
299      Dealer       Manual      0          2025          8   high
300      Dealer       Manual      0          2025          9   high

[301 rows x 12 columns]
    Car_Name  Year  Selling_Price  Present_Price  Kms_Driven Fuel_Type  \
0       ritz  2014           3.35           5.59       27000    Petrol
1        sx4  2013           4.75           9.54       43000    Diesel
2       ciaz  2017           7.25           9.85        6900    Petrol
3    wagon r  2011           2.85           4.15        5200    Petrol
4      swift  2014           4.60           6.87       42450    Diesel
..       ...   ...            ...            ...         ...       ...
296     city  2016           9.50          11.60       33988    Diesel
297     brio  2015           4.00           5.90       60000    Petrol
298     city  2009           3.35          11.00       87934    Petrol
299     city  2017          11.50          12.50        9000    Diesel
300     brio  2016           5.30           5.90        5464    Petrol

    Seller_Type Transmission  Owner  Current_Year  Differnce Review
0        Dealer       Manual      0          2025         11   high
1        Dealer       Manual      0          2025         12   high
2        Dealer       Manual      0          2025          8   high
3        Dealer       Manual      0          2025         14    low
4        Dealer       Manual      0          2025         11   high
..          ...          ...    ...           ...        ...    ...
296      Dealer       Manual      0          2025          9   high
297      Dealer       Manual      0          2025         10   high
298      Dealer       Manual      0          2025         16   high
299      Dealer       Manual      0          2025          8   high
300      Dealer       Manual      0          2025          9   high

[301 rows x 12 columns]
    Car_Name  Year  Selling_Price  Present_Price  Kms_Driven Fuel_Type  \
0       ritz  2014           3.35           5.59       27000    Petrol
1        sx4  2013           4.75           9.54       43000    Diesel
2       ciaz  2017           7.25           9.85        6900    Petrol
3    wagon r  2011           2.85           4.15        5200    Petrol
4      swift  2014           4.60           6.87       42450    Diesel
..       ...   ...            ...            ...         ...       ...
296     city  2016           9.50          11.60       33988    Diesel
297     brio  2015           4.00           5.90       60000    Petrol
298     city  2009           3.35          11.00       87934    Petrol
299     city  2017          11.50          12.50        9000    Diesel
300     brio  2016           5.30           5.90        5464    Petrol

    Seller_Type Transmission  Owner  Current_Year  Differnce Review
0        Dealer       Manual      0          2025         11   high
1        Dealer       Manual      0          2025         12   high
2        Dealer       Manual      0          2025          8   high
3        Dealer       Manual      0          2025         14    low
4        Dealer       Manual      0          2025         11   high
..          ...          ...    ...           ...        ...    ...

In [ ]:
for i in df1:
     print(df1[i])

In [ ]:
df

In [ ]:
df.head()

In [ ]:
pd.Categorical(df)

In [ ]:
pd.Categorical(df['Embarked'])

In [ ]:
pd.Categorical(df['Sex'])

In [ ]:
pd.Categorical(df['Pclass'])

In [1947]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [1948]:
df['Pclass'].unique()

array([3, 1, 2])

In [1949]:
a =["abc","def","hello","good"]

In [1950]:
df = pd.Series(a)

In [1951]:
df

0      abc
1      def
2    hello
3     good
dtype: object

In [1952]:
df1.duplicated().sum()

np.int64(2)

In [1953]:
df1.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
296    False
297    False
298    False
299    False
300    False
Length: 301, dtype: bool

In [1954]:
df1[df1.duplicated() == True]

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Differnce,Review
17,ertiga,2016,7.75,10.79,43000,Diesel,Dealer,Manual,0,2025,9,high
93,fortuner,2015,23.00,30.61,40000,Diesel,Dealer,Automatic,0,2025,10,high

In [1955]:
df1.drop_duplicates(inplace=True)

In [1956]:
df1

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Differnce,Review
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,2025,11,high
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,2025,12,high
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,2025,8,high
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,2025,14,low
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,2025,11,high
...,...,...,...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0,2025,9,high
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0,2025,10,high
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0,2025,16,high
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0,2025,8,high
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0,2025,9,high

In [1957]:
df1.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Current_Year,Differnce,Review
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,2025,11,high
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0,2025,12,high
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0,2025,8,high
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0,2025,14,low
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,2025,11,high

In [1958]:
df1 = df1['Year'].replace(2014,2025)

In [1959]:
df1.head()

0    2025
1    2013
2    2017
3    2011
4    2025
Name: Year, dtype: int64